c5/src/Catalogs/Mailboxes/Mailboxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Mailboxes</name>
  <owners>Catalog.Users</owners>
  <attributes>
    <name>Box</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMAPPassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMAPPort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMAPSecureAuthenticationOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IMAPServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMAPUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMAPUseSSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Leave</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POP3BeforeSMTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POP3Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3Port</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3SecureAuthenticationOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POP3ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3User</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3UseSSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Protocol</name>
    <type>
      <types>EnumRef.Protocols</types>
    </type>
  </attributes>
  <attributes>
    <name>SentFolder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SMTPPassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMTPPort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMTPSecureAuthenticationOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMTPServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMTPUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMTPUseSSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Timeout</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>OtherSenders</name>
    <attributes>
      <name>Email</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Enums/Protocols/Protocols.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Protocols</name>
  <enumValues>
    <name>POP3</name>
  </enumValues>
  <enumValues>
    <name>IMAP</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Mailboxes/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not Mailboxes.CheckAddresses ( ThisObject, "Email" ) ) then
		Cancel = true;
	endif; 
	if ( not Mailboxes.CheckName ( ThisObject, "Box" ) ) then
		Cancel = true;
	endif; 
	checkLogin ( CheckedAttributes );
	
EndProcedure

Procedure checkLogin ( CheckedAttributes )
	
	if ( Protocol = Enums.Protocols.IMAP ) then
		CheckedAttributes.Add ( "IMAPUser" );
		CheckedAttributes.Add ( "IMAPPassword" );
		CheckedAttributes.Add ( "IMAPServerAddress" );
	elsif ( Protocol = Enums.Protocols.POP3 ) then
		CheckedAttributes.Add ( "POP3User" );
		CheckedAttributes.Add ( "POP3Password" );
		CheckedAttributes.Add ( "POP3ServerAddress" );
	endif; 
	
EndProcedure 

#endif
